// ─────────────────────────────────────────────────────────────────────────────
// 描述：返回一个其中的数组值不包含在其他给定数组中的新数组，其中结果值的顺序和引用由第一个数组决定
// ─────────────────────────────────────────────────────────────────────────────


// ─────────────────────────────────────────────────────────────────────────────
// * @param array The array to inspect.
// * @param values The arrays of values to exclude.

// <T>(array, ...values): T[]

// array: 
// List<T> | null | undefined
// ...values:
// Array<List<T>>
// ─────────────────────────────────────────────────────────────────────────────
import { difference } from "lodash-es";



// 原始集合
const arr1 = [3, 2, 1];
const arr2 = [3, 2, 4];
const arr3 = [3, 4, 5];

// ─────────────────────────────────────────────────────────────────────────────
// 将第一个数组中第二个数组有的元素过滤
// ─────────────────────────────────────────────────────────────────────────────
console.log(
    difference(arr1, arr2, arr3)
);
// [ 1 ]