// ─────────────────────────────────────────────────────────────────────────────
// 描述：返回一个移除指定元素的新数组
// ─────────────────────────────────────────────────────────────────────────────


// ─────────────────────────────────────────────────────────────────────────────
// * @param array The array to modify.
// * @param predicate The function invoked per iteration.

// <T>(array: List<T>, predicate?: ListIteratee<T>): T[];

// array:
// List<T>,
// predicate?:
// ListIteratee<T>
// ─────────────────────────────────────────────────────────────────────────────
import { remove } from "lodash-es";



// 原始集合
const arr = [1, 1, 1, 3, 3, 3, 2, 2, 2];

// ─────────────────────────────────────────────────────────────────────────────
// 1. 按指定函数移除元素
// 移除所有被视为“假”的元素
// ─────────────────────────────────────────────────────────────────────────────
function odd(n: number) {
    return n % 2 == 1;
}

console.log(
    "%o",
    {
        resArr: remove(arr, odd),
        originArr: arr,
    }
);

// {
//     resArr: [ 1, 1, 1, 3, 3, 3 ],
//     originArr: [ 2, 2, 2 ]       
//   }