// ─────────────────────────────────────────────────────────────────────────────
// 描述：返回一个包含所传入对象的指定路径值的新数组
// ─────────────────────────────────────────────────────────────────────────────


// ─────────────────────────────────────────────────────────────────────────────
// * @param object The object to iterate over.
// * @param props The property names or indexes of elements to pick, specified individually or in arrays.

// <T>(object, ...props): Array<T[keyof T]>

// object: 
// T | null | undefined
// ...props:
// Array<Many<keyof T>>
// ─────────────────────────────────────────────────────────────────────────────
import { at } from "lodash-es";



// 原始对象
const obj = {
    a: {
        c: 1
    },
    b: [1, {
        d: [1, 2, 3]
    }, 3],
}

// ─────────────────────────────────────────────────────────────────────────────
// 获取对象指定路径值
// ─────────────────────────────────────────────────────────────────────────────
console.log(
    at(obj, ["a.c", "b[1].d[0]"]),
    at(obj, ["a", "b[1].d[3]"]),
);
// [ 1, 1 ] 
// [ { c: 1 }, undefined ]