// ─────────────────────────────────────────────────────────────────────────────
// 描述：将第一个字符转为大写，其余字符转为小写
// ─────────────────────────────────────────────────────────────────────────────


// ─────────────────────────────────────────────────────────────────────────────
// * @param string The string to capitalize.

// (string?: string): string

// string?:
// string
// ─────────────────────────────────────────────────────────────────────────────
import { capitalize } from "lodash-es";



// 原始字符串
const str = "foo bar";
const str1 = "fOO bAR";
const str2 = "Foo Bar";
const str3 = "123";

// ─────────────────────────────────────────────────────────────────────────────
// 字符串转换
// ─────────────────────────────────────────────────────────────────────────────
console.log(
    capitalize(str),
    capitalize(str1),
    capitalize(str2),
    capitalize(str3),
);

// Foo bar 
// Foo bar 
// Foo bar
// 123