// ─────────────────────────────────────────────────────────────────────────────
// 描述：判断字符串是否以给定字符作为结尾
// ─────────────────────────────────────────────────────────────────────────────


// ─────────────────────────────────────────────────────────────────────────────
// * @param string The string to search.
// * @param target The string to search for.
// * @param position The position to search from.

// (string?: string, target?: string, position?: number): boolean

// string?:
// string
// target?:
// string
// position?:
// number
// ─────────────────────────────────────────────────────────────────────────────
import { endsWith } from "lodash-es";



// 原始字符串
const str = "Foo Bar";

// ─────────────────────────────────────────────────────────────────────────────
// 1.给定字符
// ─────────────────────────────────────────────────────────────────────────────
// console.log(
//     endsWith(str, "r"),
//     endsWith(str, "a"),
// );

// ─────────────────────────────────────────────────────────────────────────────
// 2.给定字符及给定检查位置
// ─────────────────────────────────────────────────────────────────────────────
console.log(
    endsWith(str, "r", str.length),
    endsWith(str, "r", 0),
    endsWith(str, "a", str.length - 1),
);

// true
// false
// true