// ─────────────────────────────────────────────────────────────────────────────
// 描述：将给定的字符串的第一个字符转换为小写
// ─────────────────────────────────────────────────────────────────────────────


// ─────────────────────────────────────────────────────────────────────────────
// * @param string The string to convert.

// (string?: string): string;

// string?:
// string
// ─────────────────────────────────────────────────────────────────────────────
import { lowerFirst } from "lodash-es";



// 原始字符串
const str = "Foo Bar";
const str1 = "----Foo-Bar----";
const str2 = "___Foo_Bar___";
const str3 = "___FooBar___";
const str4 = "___Foobar___";

// ─────────────────────────────────────────────────────────────────────────────
// 转换字符串
// ─────────────────────────────────────────────────────────────────────────────
console.log(
    lowerFirst(str),
    lowerFirst(str1),
    lowerFirst(str2),
    lowerFirst(str3),
    lowerFirst(str4),
);

// foo Bar
// ----Foo-Bar----
// ___Foo_Bar___
// ___FooBar___
// ___Foobar___