// ─────────────────────────────────────────────────────────────────────────────
// 描述：将给定的字符串转换为小写
// ─────────────────────────────────────────────────────────────────────────────


// ─────────────────────────────────────────────────────────────────────────────
// * @param string The string to convert.

// (string?: string): string;

// string?:
// string
// ─────────────────────────────────────────────────────────────────────────────
import { lowerCase } from "lodash-es";



// 原始字符串
const str = "Foo Bar";
const str1 = "----Foo-Bar----";
const str2 = "___Foo_Bar___";
const str3 = "___FooBar___";
const str4 = "___Foobar___";

// ─────────────────────────────────────────────────────────────────────────────
// 转换字符串
// ─────────────────────────────────────────────────────────────────────────────
console.log(
    lowerCase(str),
    lowerCase(str1),
    lowerCase(str2),
    lowerCase(str3),
    lowerCase(str4),
);

// foo bar
// foo bar
// foo bar
// foo bar
// foobar