// ─────────────────────────────────────────────────────────────────────────────
// 描述：判断字符串是否以给定字符作为开头
// ─────────────────────────────────────────────────────────────────────────────


// ─────────────────────────────────────────────────────────────────────────────
// * @param string The string to search.
// * @param target The string to search for.
// * @param position The position to search from.

// (string?: string, target?: string, position?: number): boolean

// string?:
// string
// target?:
// string
// position?:
// number
// ─────────────────────────────────────────────────────────────────────────────
import { startsWith } from "lodash-es";



// 原始字符串
const str = "Foo Bar";

// ─────────────────────────────────────────────────────────────────────────────
// 1.给定字符
// ─────────────────────────────────────────────────────────────────────────────
console.log(
    startsWith(str, "F"),
    startsWith(str, "a"),
);
// true 
// false

// ─────────────────────────────────────────────────────────────────────────────
// 2.给定字符及给定检查位置
// ─────────────────────────────────────────────────────────────────────────────
console.log(
    startsWith(str, "f", 0),
    startsWith(str, "F", 0),
    startsWith(str, "a", str.length - 2),
);
// false
// true
// true