// ─────────────────────────────────────────────────────────────────────────────
// 描述：将给定的字符串转换为小写
// ─────────────────────────────────────────────────────────────────────────────


// ─────────────────────────────────────────────────────────────────────────────
// * @param string The string to convert.

// (string?: string): string;

// string?:
// string
// ─────────────────────────────────────────────────────────────────────────────
import { toLower } from "lodash-es";



// 原始字符串
const str = "Foo Bar";
const str1 = "----Foo-Bar----";
const str2 = "___Foo_Bar___";
const str3 = "___FooBar___";
const str4 = "___Foobar___";

// ─────────────────────────────────────────────────────────────────────────────
// 转换字符串
// ─────────────────────────────────────────────────────────────────────────────
console.log(
    toLower(str),
    toLower(str1),
    toLower(str2),
    toLower(str3),
    toLower(str4),
);

// foo bar
// ----foo-bar----
// ___foo_bar___
// ___foobar___
// ___foobar___