// ─────────────────────────────────────────────────────────────────────────────
// 描述：将给定的字符串转换为大写
// ─────────────────────────────────────────────────────────────────────────────


// ─────────────────────────────────────────────────────────────────────────────
// * @param string The string to convert.

// (string?: string): string;

// string?:
// string
// ─────────────────────────────────────────────────────────────────────────────
import { toUpper } from "lodash-es";



// 原始字符串
const str = "Foo Bar";
const str1 = "----Foo-Bar----";
const str2 = "___Foo_Bar___";
const str3 = "___FooBar___";
const str4 = "___Foobar___";

// ─────────────────────────────────────────────────────────────────────────────
// 转换字符串
// ─────────────────────────────────────────────────────────────────────────────
console.log(
    toUpper(str),
    toUpper(str1),
    toUpper(str2),
    toUpper(str3),
    toUpper(str4),
);

// FOO BAR
// ----FOO-BAR----
// ___FOO_BAR___
// ___FOOBAR___
// ___FOOBAR___