// ─────────────────────────────────────────────────────────────────────────────
// 描述：将给定的字符串的第一个字符转换为小写
// ─────────────────────────────────────────────────────────────────────────────


// ─────────────────────────────────────────────────────────────────────────────
// * @param string The string to convert.

// (string?: string): string;

// string?:
// string
// ─────────────────────────────────────────────────────────────────────────────
import { upperFirst } from "lodash-es";



// 原始字符串
const str = "foo Bar";
const str1 = "----foo-Bar----";
const str2 = "___foo_Bar___";
const str3 = "___fooBar___";
const str4 = "___foobar___";

// ─────────────────────────────────────────────────────────────────────────────
// 转换字符串
// ─────────────────────────────────────────────────────────────────────────────
console.log(
    upperFirst(str),
    upperFirst(str1),
    upperFirst(str2),
    upperFirst(str3),
    upperFirst(str4),
);

// Foo Bar
// ----foo-Bar----
// ___foo_Bar___
// ___fooBar___
// ___foobar___