// ─────────────────────────────────────────────────────────────────────────────
// 描述：将给定的字符串转换为大写写
// ─────────────────────────────────────────────────────────────────────────────


// ─────────────────────────────────────────────────────────────────────────────
// * @param string The string to convert.

// (string?: string): string;

// string?:
// string
// ─────────────────────────────────────────────────────────────────────────────
import { upperCase } from "lodash-es";



// 原始字符串
const str = "Foo Bar";
const str1 = "----Foo-Bar----";
const str2 = "___Foo_Bar___";
const str3 = "___FooBar___";
const str4 = "___Foobar___";

// ─────────────────────────────────────────────────────────────────────────────
// 转换字符串
// ─────────────────────────────────────────────────────────────────────────────
console.log(
    upperCase(str),
    upperCase(str1),
    upperCase(str2),
    upperCase(str3),
    upperCase(str4),
);

// FOO BAR
// FOO BAR
// FOO BAR
// FOO BAR
// FOOBAR